"ACCESS_DENIED"="The path %1$s cannot be accessed.";
"BAD_ATTRIBUTE"="The attribute specification \"%1$c\" is not valid.";
"BAD_OPTION"="One of the parameters begins with \":\", but is not a valid option.";
"BAD_OPTION_OR_ATTRIBUTE"="One of the parameters begins with \"-\", but is not a valid option or attribute specification.";
"BAD_PATH"="The format of the path %1$s is incorrect.";
"DOUBLE_ATTRIBUTE"="The attribute specification \"%1$c\" was repeated.";
"ERROR"="ERROR";
"FILE_CHANGED"="The file has been modified";
"FILE_NOT_CHANGED"="No changes needed";
"FILES_CHANGED_0"="no changes needed";
"FILES_CHANGED_1"="1 modified";
"FILES_CHANGED_MANY"="%1$d modified";
"FILES_PROCESSED_0"="No files processed";
"FILES_PROCESSED_1"="1 file processed";
"FILES_PROCESSED_MANY"="%1$d files processed";
"HELP"="\nShows or modifies the attributes of MP3 files.\n\nUsage:\n  MP3EPOC [:L|:S] [:W] [:F] [+P|-P] [+C|-C] [+O|-O] [:E0|:E1|:E2|:Ex] files\n\n  :L        Show attributes in extended format.\n  :S        Show attributes in compact format.\n  :W        Read whole files, not only the key frames.\n  :F        First frame is key frame (older Winamp versions).\n  +         Set an attribute or show files with an attribute set.\n  -         Clear an attribute or show files with an attribute not set.\n  P         Private attribute.\n  C         Copyright attribute.\n  O         Original attribute.\n  :E0       Remove emphasis or show files with no emphasis.\n  :E1       Set or show files with emphasis at 50/15 microsec.\n  :E2       Set or show files with emphasis at CCITT j. 17.\n  :Ex       Show files with invalid emphasis.\n  files     One or more files to process (wildcards are allowed).\n\nAttribute specs are introduced by the sign + or - and may specify different attributes at the same time like in +PO or -OCP; the :E0, :E1, :E2 and :Ex options are also considered attribute specs, but they cannot be combined.\n\nIf the command line contains any attribute specs without any of the options :L, :S, :W or :F, MP3epoc writes the new attribute settings in every MP3 file specified.\nIf the command line contains any attribute specs along with any of the options :L, :S, :W or :F, MP3epoc shows the MP3 files matching the specified attributes without modifying them.\nIf the command line doesn't contain any attribute specs, MP3epoc shows the attributes of the MP3 files without modifying them: in this case, attributes are always displayed in extended format, unless the :S option is explicitly specified.\nSome examples:\n\n  > MP3EPOC *.MP3\n  Shows in extended format the attributes of all MP3 files in the current directory.\n\n  > MP3EPOC -C +O \"Madonna - Material Girl.mp3\"\n  Clears the copyright attribute and sets the original attribute in all frames of the file \"Madonna - Material Girl.mp3\".\n\n  > MP3EPOC :S :W :E1 \"~/Music/*Mozart*.MP3\"\n  Shows in compact format the attributes of all MP3 files in the folder \"~/Music\" containing the word \"Mozart\" in the name and having the emphasis set at 50/15 microsec in all frames.\n  \n  > MP3EPOC -PCO :E0 \"/Volumes/My-Host/Shared MP3s/*\"\n  Clears the private, copyright and original attributes and removes the emphasis from all frames of all files in the network folder \"Shared MP3s\" on \"My-Host\".\n\nAttributes representation in extended format follows the general scheme:\n\n  ±P* ±C* ±O* E?*\n\nThe letters P, C, O and E stand for the private, copyright, original and emphasis attributes respectively. The sign + before a letter indicates that the corresponding attribute is set. The sign - before a letter indicates that the attribute is not set.\nThe emphasis setting is indicated by the character after the E: 0 = no emphasis, 1 = 50/15 microsec, 2 = CCITT j. 17, x = invalid emphasis.\nIf using the :W option, an asterisk after an attribute means that the settings of the attribute are the same in all frames of the file.\n\nThe compact format shows the same information as the extended format in less space, it is just somewhat more complicated to read. The compact format uses one letter for each attribute in the sequence: private, copyright, original, emphasis. The different letters have the following meaning:\n\n  j = emphasis at CCITT j. 17\n  m = emphasis at 50/15 microsec\n  n = attribute not set or no emphasis\n  x = invalid emphasis\n  y = attribute set\n\nA capital letter means that the settings of the attribute are the same in all frames of the file.\n\nAltough attribute settings are generally identical for all frames of an MP3 file, this is not always true.\nThe settings Winamp shows in the file info dialog for MP3 files are those found in the second frame of the file: this is the default key frame, the one from which MP3epoc normally extracts its informations to show the main settings of attributes or to exclude specific files from the search when the :W option is omitted. Some older Winamp versions and other applications consider rather the first frame as the file's key frame. The same behavior can be achieved with MP3epoc by specifying the :F option.";
"MP3_DATA_UNKNOWN_EXCEPTION"="The file %2$s contains unknown data at offset %1$s.";
"MP3_FILE_INVALID_EXCEPTION"="%1$s is not an MP3 file.";
"MP3_FIRST_FRAME_NOT_FOUND_EXCEPTION"="Either the size of the file %1$s or the information in the ID3v2 tag is wrong.";
"MP3_FORMAT_EXCEPTION"="An error occurred while processing file %2$s at offset %1$s.";
"MP3_FRAME_CRC_TEST_EXCEPTION"="Frame %1$lld in file %3$s at offset %2$s is corrupt and did not pass the CRC test.";
"MP3_FRAME_CRC_UNKNOWN_EXCEPTION"="The CRC of frame %1$lld in file %3$s at offset %2$s cannot be recalculated.";
"MP3_FRAME_EXCEPTION"="An error occurred while processing frame %1$lld in file %3$s at offset %2$s.";
"MP3_FRAME_SIZE_UNKNOWN_EXCEPTION"="The size of frame %1$lld in file %3$s at offset %2$s cannot be determined.";
"MP3_GENERIC_EXCEPTION"="An error occurred while processing file %1$s.";
"MP3_KEY_FRAME_NOT_FOUND_EXCEPTION"="The file %1$s has no key frame.";
"NO_FILE"="No file was specified.";
"OPT_EX_IN_WRITING_OP"="The :Ex option can only be used together with any of the options :L, :S, :W or :F.";
"PATH_IS_DIR"="The path %1$s denotes a directory.";
"PATH_NOT_FOUND"="The path %1$s was not found.";
"SYNTAX_ERROR"="The syntax of the command is incorrect.";
